In [16]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [34]:
gdp_df = pd.read_csv('~/nss_data_science/data-question-1-unewsome/data/gdp_percapita.csv', nrows=6206)
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2016  1802.695566              NaN
1     Afghanistan  2015  1809.016488              NaN
2     Afghanistan  2014  1838.960244              NaN
3     Afghanistan  2013  1848.700026              NaN
4     Afghanistan  2012  1839.273579              NaN
5     Afghanistan  2011  1660.739856              NaN

In [43]:
internet_df = pd.read_csv('~/nss_data_science/data-question-1-unewsome/data/internet_use.csv', nrows=4495)
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

In [46]:
internet_df.shape

(4495, 4)

In [47]:
gdp_df.shape

(6206, 4)

In [52]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [53]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [65]:
del gdp_df['Value Footnotes']
gdp_df.tail(10)

     Country or Area  Year        Value
6196        Zimbabwe  1999  2699.857521
6197        Zimbabwe  1998  2761.318537
6198        Zimbabwe  1997  2725.888701
6199        Zimbabwe  1996  2698.917300
6200        Zimbabwe  1995  2488.298028
6201        Zimbabwe  1994  2529.826671
6202        Zimbabwe  1993  2360.793284
6203        Zimbabwe  1992  2384.972026
6204        Zimbabwe  1991  2681.495089
6205        Zimbabwe  1990  2605.794944

In [64]:
del internet_df['Value Footnotes']
internet_df.tail(10)

     Country or Area  Year     Value
4485        Zimbabwe  2002  3.994356
4486        Zimbabwe  2001  0.799846
4487        Zimbabwe  2000  0.401434
4488        Zimbabwe  1999  0.161676
4489        Zimbabwe  1998  0.081648
4490        Zimbabwe  1997  0.033080
4491        Zimbabwe  1996  0.016790
4492        Zimbabwe  1995  0.007684
4493        Zimbabwe  1994  0.001739
4494        Zimbabwe  1990  0.000000

In [56]:
gdp_df.columns

Index(['Country or Area', 'Year', 'Value', 'Value Footnotes'], dtype='object')

In [67]:
gdp_df.columns=['Country','Year','GDP_Per_Capita']
internet_df.columns=['Country','Year','Internet_Users_Pct']

In [68]:
gdp_df.join.__doc__

"\n        Join columns with other DataFrame either on index or on a key\n        column. Efficiently Join multiple DataFrame objects by index at once by\n        passing a list.\n\n        Parameters\n        ----------\n        other : DataFrame, Series with name field set, or list of DataFrame\n            Index should be similar to one of the columns in this one. If a\n            Series is passed, its name attribute must be set, and that will be\n            used as the column name in the resulting joined DataFrame\n        on : name, tuple/list of names, or array-like\n            Column or index level name(s) in the caller to join on the index\n            in `other`, otherwise joins index-on-index. If multiple\n            values given, the `other` DataFrame must have a MultiIndex. Can\n            pass an array as the join key if it is not already contained in\n            the calling DataFrame. Like an Excel VLOOKUP operation\n        how : {'left', 'right', 'outer', 'inner'}, default: 'left'\n            How to handle the operation of the two objects.\n\n            * left: use calling frame's index (or column if on is specified)\n            * right: use other frame's index\n            * outer: form union of calling frame's index (or column if on is\n              specified) with other frame's index, and sort it\n              lexicographically\n            * inner: form intersection of calling frame's index (or column if\n              on is specified) with other frame's index, preserving the order\n              of the calling's one\n        lsuffix : string\n            Suffix to use from left frame's overlapping columns\n        rsuffix : string\n            Suffix to use from right frame's overlapping columns\n        sort : boolean, default False\n            Order result DataFrame lexicographically by the join key. If False,\n            the order of the join key depends on the join type (how keyword)\n\n        Notes\n        -----\n        on, lsuffix, and rsuffix options are not supported when passing a list\n        of DataFrame objects\n\n        Support for specifying index levels as the `on` parameter was added\n        in version 0.23.0\n\n        Examples\n        --------\n        >>> caller = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3', 'K4', 'K5'],\n        ...                        'A': ['A0', 'A1', 'A2', 'A3', 'A4', 'A5']})\n\n        >>> caller\n            A key\n        0  A0  K0\n        1  A1  K1\n        2  A2  K2\n        3  A3  K3\n        4  A4  K4\n        5  A5  K5\n\n        >>> other = pd.DataFrame({'key': ['K0', 'K1', 'K2'],\n        ...                       'B': ['B0', 'B1', 'B2']})\n\n        >>> other\n            B key\n        0  B0  K0\n        1  B1  K1\n        2  B2  K2\n\n        Join DataFrames using their indexes.\n\n        >>> caller.join(other, lsuffix='_caller', rsuffix='_other')\n\n        >>>     A key_caller    B key_other\n            0  A0         K0   B0        K0\n            1  A1         K1   B1        K1\n            2  A2         K2   B2        K2\n            3  A3         K3  NaN       NaN\n            4  A4         K4  NaN       NaN\n            5  A5         K5  NaN       NaN\n\n\n        If we want to join using the key columns, we need to set key to be\n        the index in both caller and other. The joined DataFrame will have\n        key as its index.\n\n        >>> caller.set_index('key').join(other.set_index('key'))\n\n        >>>      A    B\n            key\n            K0   A0   B0\n            K1   A1   B1\n            K2   A2   B2\n            K3   A3  NaN\n            K4   A4  NaN\n            K5   A5  NaN\n\n        Another option to join using the key columns is to use the on\n        parameter. DataFrame.join always uses other's index but we can use any\n        column in the caller. This method preserves the original caller's\n        index in the result.\n\n        >>> caller.join(other.set_index('key'), on='key')\n\n        >>>     A key    B\n            0  A0  K0   B0\n            1  A1  K1   B1\n            2  A2  K2   B2\n            3  A3  K3  NaN\n            4  A4  K4  NaN\n            5  A5  K5  NaN\n\n\n        See also\n        --------\n        DataFrame.merge : For column(s)-on-columns(s) operations\n\n        Returns\n        -------\n        joined : DataFrame\n        "